In [3]:
import numpy as np
import pandas as pd

In [4]:
data = np.random.randn(4,3)

In [5]:
data

array([[ 0.44113404,  0.72648948, -1.60646186],
       [ 1.21695758,  0.60571284, -0.622998  ],
       [ 0.0200881 ,  2.06036478, -0.67141472],
       [ 2.41967297, -0.03565349,  1.63401798]])

In [6]:
dataFrame = pd.DataFrame(data)

In [8]:
dataFrame

          0         1         2
0  0.441134  0.726489 -1.606462
1  1.216958  0.605713 -0.622998
2  0.020088  2.060365 -0.671415
3  2.419673 -0.035653  1.634018

In [9]:
dataFrame[0]

0    0.441134
1    1.216958
2    0.020088
3    2.419673
Name: 0, dtype: float64

In [10]:
type(dataFrame[0] )

pandas.core.series.Series

In [11]:
dataFrame                  #indeksleri ve kolonları sayısal ifadeden kendimzin belirlediği şekiilde yazdıralım

          0         1         2
0  0.441134  0.726489 -1.606462
1  1.216958  0.605713 -0.622998
2  0.020088  2.060365 -0.671415
3  2.419673 -0.035653  1.634018

In [12]:
yeniDataFrame = pd.DataFrame(data,index = ["Büşra", "Ecrin","Fatih","İlayda"], columns = ["Maas", "Yas", "Calisma Saati"])

In [13]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Büşra   0.441134  0.726489      -1.606462
Ecrin   1.216958  0.605713      -0.622998
Fatih   0.020088  2.060365      -0.671415
İlayda  2.419673 -0.035653       1.634018

In [14]:
yeniDataFrame["Yas"]  #seçilen kolonun indeks numaraları ile kolondaki bilgiler ve kolona ait isim ve tip bilgisi yazdırılır.

Büşra     0.726489
Ecrin     0.605713
Fatih     2.060365
İlayda   -0.035653
Name: Yas, dtype: float64

In [15]:
yeniDataFrame.loc["Büşra"]          #satır seçmek için.. --> loc

Maas             0.441134
Yas              0.726489
Calisma Saati   -1.606462
Name: Büşra, dtype: float64

In [16]:
yeniDataFrame.iloc[0]               #satırları inkeks olarak seçmek için.. --> iloc

Maas             0.441134
Yas              0.726489
Calisma Saati   -1.606462
Name: Büşra, dtype: float64

In [37]:
#kolon indeksi eklemek için...
yeniDataFrame["Emeklilik yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik yasi
Büşra   0.441134  0.726489      -1.606462        1.452979
Ecrin   1.216958  0.605713      -0.622998        1.211426
Fatih   0.020088  2.060365      -0.671415        4.120730
İlayda  2.419673 -0.035653       1.634018       -0.071307

In [38]:
yeniDataFrame.drop("Emeklilik yasi",axis = 1, inplace = True)      #eklediğimiz kolon indeksini çıkarmak için...

In [42]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Büşra   0.441134  0.726489      -1.606462
Ecrin   1.216958  0.605713      -0.622998
Fatih   0.020088  2.060365      -0.671415
İlayda  2.419673 -0.035653       1.634018

In [43]:
yeniDataFrame.iloc[0,1]

0.7264894846174258

In [44]:
yeniDataFrame.loc["Büşra", "Yas"]

0.7264894846174258

In [46]:
yeniDataFrame < 0           # sıfırdan küçük olan kısımlar True yazdır

         Maas    Yas  Calisma Saati
Büşra   False  False           True
Ecrin   False  False           True
Fatih   False  False           True
İlayda  False   True          False

In [48]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]    # yaş kolonunda sıfırdan büyük olan indeksler yazdırılır.

           Maas       Yas  Calisma Saati
Büşra  0.441134  0.726489      -1.606462
Ecrin  1.216958  0.605713      -0.622998
Fatih  0.020088  2.060365      -0.671415

In [49]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0   Büşra  0.441134  0.726489      -1.606462
1   Ecrin  1.216958  0.605713      -0.622998
2   Fatih  0.020088  2.060365      -0.671415
3  İlayda  2.419673 -0.035653       1.634018

In [50]:
yeniIndeksListesi = ["büş", "ecr", "fa", "ilay"]

In [51]:
yeniDataFrame["Yeni Liste"] = yeniIndeksListesi

In [52]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Liste
Büşra   0.441134  0.726489      -1.606462        büş
Ecrin   1.216958  0.605713      -0.622998        ecr
Fatih   0.020088  2.060365      -0.671415         fa
İlayda  2.419673 -0.035653       1.634018       ilay

In [54]:
yeniDataFrame.set_index("Yeni Liste", inplace =True)      #inplace = True diyerek değişikliği kalıcı olarak değişir.

In [55]:
yeniDataFrame

                Maas       Yas  Calisma Saati
Yeni Liste
büş         0.441134  0.726489      -1.606462
ecr         1.216958  0.605713      -0.622998
fa          0.020088  2.060365      -0.671415
ilay        2.419673 -0.035653       1.634018

In [56]:
yeniDataFrame.loc["ilay"]

Maas             2.419673
Yas             -0.035653
Calisma Saati    1.634018
Name: ilay, dtype: float64

In [59]:
# Multi indeks
ilkIndex = ["Türkiye", "Türkiye", "Türkiye", "ABD", "ABD", "ABD"]
icIndex  = ["İstanbul", "Ankara", "Sivas", "New York", "Washington DC", "Teksas"]

In [60]:
birlesmisIndex = list(zip(ilkIndex,icIndex))

In [61]:
birlesmisIndex

[('Türkiye', 'İstanbul'),
 ('Türkiye', 'Ankara'),
 ('Türkiye', 'Sivas'),
 ('ABD', 'New York'),
 ('ABD', 'Washington DC'),
 ('ABD', 'Teksas')]

In [62]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [64]:
birlesmisIndex            # MultiIndex olarak tanımla..

MultiIndex([('Türkiye',      'İstanbul'),
            ('Türkiye',        'Ankara'),
            ('Türkiye',         'Sivas'),
            (    'ABD',      'New York'),
            (    'ABD', 'Washington DC'),
            (    'ABD',        'Teksas')],
           )

In [65]:
type(birlesmisIndex)

pandas.core.indexes.multi.MultiIndex

In [73]:
numaralar = [[34, "otuzdört"], [ 6, "altı"], [58, "ellisekiz"], [32,"otuziki"], [5,"beş"],[ 57, "elliyedi"]]
numaralarNumpyDizisi = np.array(numaralar)

In [74]:
numaralarDataFrame = pd.DataFrame(numaralarNumpyDizisi, index = birlesmisIndex,columns = ["Plaka", "PlakaYazi"] )

In [75]:
numaralarDataFrame

                      Plaka  PlakaYazi
Türkiye İstanbul         34   otuzdört
        Ankara            6       altı
        Sivas            58  ellisekiz
ABD     New York         32    otuziki
        Washington DC     5        beş
        Teksas           57   elliyedi

In [78]:
numaralarDataFrame.loc["Türkiye"]

         Plaka  PlakaYazi
İstanbul    34   otuzdört
Ankara       6       altı
Sivas       58  ellisekiz

In [79]:
numaralarDataFrame.loc["Türkiye"].loc["İstanbul"]

Plaka              34
PlakaYazi    otuzdört
Name: İstanbul, dtype: object

In [80]:
numaralarDataFrame.index.names = ["Ülke" , "Şehir"]

In [81]:
numaralarDataFrame

                      Plaka  PlakaYazi
Ülke    Şehir
Türkiye İstanbul         34   otuzdört
        Ankara            6       altı
        Sivas            58  ellisekiz
ABD     New York         32    otuziki
        Washington DC     5        beş
        Teksas           57   elliyedi